Revit 2027 API
SpecTypeId.StructuralFrequency Property
 Frequency, in discipline Structural.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralFrequency { get; }
Public Shared ReadOnly Property StructuralFrequency As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralFrequency {
	ForgeTypeId^ get ();
}
static member StructuralFrequency : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace